import React from 'react'

const AboutBox = (): React.JSX.Element => {
    return (
        <div className="about">
            <div className='about-box'>
                <div className="header">
                    <div className="head">
                        <h1>About Us</h1>
                    </div>
                    <div className="description">
                        <div className="content">
                            <p>
                                ร้านมีนโมบายเป็นร้านจำหน่ายโทรศัพท์มือถือที่ก่อตั้งโดย คุณมีน ผู้หลงใหลในเทคโนโลยีและการสื่อสาร คุณมีนเริ่มต้นร้านนี้ด้วยความมุ่งมั่นที่จะมอบประสบการณ์ที่ดีที่สุดให้แก่ลูกค้า ผ่านผลิตภัณฑ์คุณภาพสูง และบริการที่ใส่ใจในทุกรายละเอียด
                                ร้านมีนโมบายมีโทรศัพท์มือถือและอุปกรณ์เสริมให้เลือกหลากหลาย รวมถึงบริการซ่อมแซมและคำปรึกษาในการเลือกซื้อโทรศัพท์ที่ตอบโจทย์ความต้องการของลูกค้า ทีมงานของร้านได้รับการฝึกอบรมอย่างมืออาชีพ และพร้อมให้บริการด้วยความเป็นกันเอง
                                ด้วยความเชื่อในพลังของการสื่อสารและเทคโนโลยี ร้านมีนโมบายยังมุ่งมั่นพัฒนาชุมชนผ่านกิจกรรมเพื่อสังคม เช่น การให้ความรู้เกี่ยวกับการใช้เทคโนโลยีอย่างปลอดภัยและสร้างสรรค์
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default AboutBox